import matplotlib.pyplot as plt
import numpy as np

xv = [5,10,15,20,25,30,35]

#conexos

y20 = [0.139,0.309,1.414,2.840,6.155,13.926,23.762]
y30 = [0.129, 0.342, 1.322, 3.785, 7.712, 14.838, 25.420]
y50 = [0.16, 0.432, 2.125, 4.774, 9.239, 63.63, 145.528]
y70 = [0.144, 0.498, 2.497, 9.364, 14.603, 41.965, 64.946]
y80 = [0.356, 0.666, 2.487, 8.883, 32.628, 63.601, 118.532]

#randomicos

Y20 = [0.552, 0.735, 2.826, 4.976, 12.522, 38.171, 68.958]
Y30 = [0.291, 0.713, 1.332, 3.236, 7.905, 16.340, 32.316]
Y50 = [0.627, 0.893, 4.188, 7.725, 14.330, 81.745, 98.691]
Y70 = [1.249, 1.762, 4.560, 14.943, 45.167, 99.591, 121.566]
Y80 = [0.146, 0.484, 2.773, 10.743, 26.996, 55.325, 109.401]

#conexos heuristicos

hy20 = [0.210, 0.373, 0.607, 0.957, 1.683, 4.433, 5.946]
hy30 = [0.156, 0.276, 0.498, 1.030, 2.079, 3.631, 7.102]
hy50 = [0.211, 0.451, 0.916, 1.838, 3.729, 8.449, 18.011]
hy70 = [0.157, 0.375, 1.004, 2.545, 5.274, 12.962, 30.059]
hy80 = [0.151, 0.566, 1.323, 3.212, 7.407, 17.932, 38.135]

#randomicos heuristicos

Hy20 = [0.121, 0.224, 0.975, 9.182, 9.593, 10.374, 11.339]
Hy30 = [0.088, 0.306, 0.574, 1.208, 2.455, 4.042, 7.651]
Hy50 = [0.138, 0.388, 1.164, 1.955, 4.007, 7.361, 15.415]
Hy70 = [0.473, 0.739, 1.195, 2.511, 6.399, 15.702, 33.053]
Hy80 = [0.176, 0.467, 1.091, 2.380, 5.506, 12.931, 33.381]


#solução ótima

a1 = [2,5,3,2,2,2,2]
b1 = [4,6,4,3,2,2,2]

a2 = [3,3,2,2,2,2,2]
b2 = [3,3,2,2,2,2,2]

a3 = [2,2,2,2,2,2,2]
b3 = [2,2,2,2,2,2,2]

a4 = [2,2,2,2,2,2,2]
b4 = [2,2,2,2,2,2,2]

a5 = [2,2,2,2,2,2,2]
b5 = [2,2,2,2,2,2,2]

#solução heurística

c1 = [3,8,8,4,2,2,2]
d1 = [4,8,10,11,3,2,3]

c2 = [3,3,2,2,2,3,2]
d2 = [4,7,3,2,2,2,2]

c3 = [2,2,2,3,2,2,2]
d3 = [4,2,2,2,2,3,3]

c4 = [2,3,3,2,2,2,2]
d4 = [3,2,2,2,2,2,2]

c5 = [2,2,2,2,2,2,2]
d5 = [2,2,2,2,2,2,2]

#GAP heuristica

h1 = [0, 50, 160, 100, 0, 0, 0]
r1 = [0,33,15,260,50,0,50]

h2 = [0,0,0,0,0,50,0]
r2 = [33,66,50,0,0,0,0]

h3 = [0,0,0,50,0,0,0]
r3 = [100, 0,0,0,0,50,50]

h4 = [0,50,50,0,0,0,0]
r4 = [50,0,0,0,0,0,0]

h5 = [0,0,0,0,0,0,0]
r5 = [0,0,0,0,0,0,0]

barWidth = 10
o1 = np.arange(len(a1))
o2 = [x + barWidth for x in r1]


#plt.plot(xv,np.log(y20), 'bo')
#plt.plot(xv, s1, label="20%")

#plt.plot(xv,np.log(hy20), 'go')
#plt.bar(xv, np.log(Y80), label="Exato%")
#plt.bar(xv, np.log(Hy80), label="Heusrístico%")
plt.bar(o1, a1, color="red", width = barWidth, label="Exato%")
plt.bar(o2, c1, color="blue", width = barWidth,label="Heurístico")
#plt.plot(xv, r4, label="70%")
#plt.plot(xv, r5, label="80%")
'''
#plt.plot(xv,np.log(Y50))
plt.plot(xv,np.log(Hy50), label="50%")

#plt.plot(xv,np.log(Y70))
plt.plot(xv,np.log(Hy70), label="70%")

#plt.plot(xv,np.log(Y80))
plt.plot(xv,np.log(Hy80), label="80%")
'''
'''
plt.plot(xv, s1, )
plt.plot(xv,s1, 'k', color='black')

plt.plot(xv,s2, )
plt.plot(xv,s2, 'k', color='orange')

plt.plot(xv,s3)
plt.plot(xv,s3, 'k', color='red')

plt.plot(xv,s4)
plt.plot(xv,s4, 'k', color='pink')

plt.plot(xv,s5)
plt.plot(xv,s5, 'k', color='blue')

plt.xticks([5,10,15,20,25,30,35])
'''

#plt.legend(['20%', '30%', '50%', '70%', '80%'])
plt.legend(['Exato', 'Heurístico'])
plt.xlabel("Quantidade V de vértices") 
plt.ylabel("Logaritmo natural do tempo de execução")

plt.show()


